Repository: lahcenegue/good_one_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# youngerUsersParentalConsent
source: If younger users (e.g., babysitting, tutoring) are allowed in the future, parental consent and provincial legal approval may be required. (Contact customer support to send you the consent to be signed.)
ar: إذا تم السماح للمستخدمين الأصغر سناً (مثل جليسة الأطفال، التدريس) في المستقبل، فقد تكون موافقة الوالدين والموافقة القانونية الإقليمية مطلوبة. (اتصل بدعم العملاء لإرسال الموافقة لتوقيعها.)

# usersMustCreateAccount
source: Users must create an account to access the services.
ar: يجب على المستخدمين إنشاء حساب للوصول إلى الخدمات.

# responsibleForCredentials
source: You are responsible for maintaining the confidentiality of your login credentials.
ar: أنت مسؤول عن الحفاظ على سرية بيانات اعتماد تسجيل الدخول.

# notShareAccountInfo
source: You must not share your account information with others.
ar: يجب عدم مشاركة معلومات حسابك مع الآخرين.

# unauthorizedAccess
source: Any unauthorized access to your account must be reported immediately to customer support.
ar: يجب الإبلاغ فوراً عن أي وصول غير مصرح به إلى حسابك لدعم العملاء.

# communicationViaApp
source: All communication between customers and service providers must occur through the App's built-in chat feature.
ar: يجب أن تتم جميع التواصلات بين العملاء ومقدمي الخدمات من خلال ميزة الدردشة المدمجة في التطبيق.

# noPersonalContactSharing
source: Users are strictly prohibited from sharing personal contact information (e.g., phone numbers, emails) through the chat.
ar: يُمنع المستخدمون بشكل صارم من مشاركة معلومات الاتصال الشخصية (مثل أرقام الهواتف، البريد الإلكتروني) من خلال الدردشة.

# violationAccountSuspension
source: Violation of this rule may result in account suspension or termination.
ar: قد يؤدي انتهاك هذه القاعدة إلى تعليق أو إنهاء الحساب.

# allPaymentsThroughApp
source: All payments must be processed through the App.
ar: يجب معالجة جميع المدفوعات من خلال التطبيق.

# noPaymentsOutside
source: No payments outside the App are allowed. Any attempt to process payments outside the platform may result in permanent account suspension.
ar: لا يُسمح بأي مدفوعات خارج التطبيق. أي محاولة لمعالجة المدفوعات خارج المنصة قد تؤدي إلى تعليق دائم للحساب.

# serviceFeeDisclosure
source: The App may charge service fees or transaction fees, which will be disclosed before payment.
ar: قد يفرض التطبيق رسوم خدمة أو رسوم معاملات، والتي سيتم الكشف عنها قبل الدفع.

# certificationsOptional
source: Service providers can upload certifications to enhance their profile credibility, but this is optional.
ar: يمكن لمقدمي الخدمات رفع الشهادات لتعزيز مصداقية ملفهم الشخصي، لكن هذا اختياري.

# securityCheckAvailable
source: Service providers may also complete a security check through the App, which will further increase trust.
ar: يمكن لمقدمي الخدمات أيضاً إكمال فحص أمني من خلال التطبيق، مما سيزيد من الثقة أكثر.

# noJobGuarantee
source: The App does not guarantee job assignments or earnings for service providers.
ar: التطبيق لا يضمن تعيينات العمل أو الأرباح لمقدمي الخدمات.

# advertisingPolicyIntro
source: The App allows advertisements from companies and individuals, including service providers who wish to promote their services. By submitting an advertisement, you agree to the following terms:
ar: يسمح التطبيق بالإعلانات من الشركات والأفراد، بما في ذلك مقدمي الخدمات الذين يرغبون في الترويج لخدماتهم. بتقديم إعلان، فإنك توافق على الشروط التالية:

source: Eligibility to Advertise
ar: الأهلية للإعلان

# advertisersComplyLaws
source: Advertisers must comply with all applicable laws and regulations.
ar: يجب على المعلنين الامتثال لجميع القوانين واللوائح المعمول بها.

# serviceProviderAdsNotMislead
source: Service providers may advertise their services, but advertisements must not mislead users or contain false claims.
ar: يمكن لمقدمي الخدمات الإعلان عن خدماتهم، لكن يجب ألا تضلل الإعلانات المستخدمين أو تحتوي على ادعاءات كاذبة.

# companiesEnsureRelevantAds
source: Companies must ensure that their ads are relevant to the platform's audience.
ar: يجب على الشركات ضمان أن إعلاناتها ذات صلة بجمهور المنصة.

source: Ad Content Guidelines
ar: إرشادات محتوى الإعلان

# adsTruthfulAccurate
source: Ads must be truthful, accurate, and not misleading.
ar: يجب أن تكون الإعلانات صادقة ودقيقة وغير مضللة.

# adsNotPromoteIllegal
source: Ads must not promote illegal activities, violence, discrimination, or explicit content.
ar: يجب ألا تروج الإعلانات للأنشطة غير القانونية أو العنف أو التمييز أو المحتوى الصريح.

# adsNoPersonalContact
source: Ads must not include personal contact details (e.g., phone numbers, email addresses) to ensure transactions remain within the App.
ar: يجب ألا تتضمن الإعلانات تفاصيل الاتصال الشخصية (مثل أرقام الهواتف، عناوين البريد الإلكتروني) لضمان بقاء المعاملات داخل التطبيق.

# appReviewRejectAds
source: The App reserves the right to review and reject any advertisement that does not align with these guidelines.
ar: يحتفظ التطبيق بالحق في مراجعة ورفض أي إعلان لا يتماشى مع هذه الإرشادات.

# adPlacementFees
source: Ad Placement and Fees
ar: وضع الإعلانات والرسوم

# advertisersChoosePlacement
source: Advertisers may choose from different ad placement options within the App.
ar: يمكن للمعلنين الاختيار من بين خيارات وضع إعلانات مختلفة داخل التطبيق.

# advertisingFeesVary
source: Advertising fees vary based on placement, duration, and visibility.
ar: تختلف رسوم الإعلان حسب الموضع والمدة والرؤية.

# adPaymentThroughApp
source: Payment for advertisements must be processed through the App.
ar: يجب معالجة دفع الإعلانات من خلال التطبيق.

# adRemovalViolations
source: Ad Removal and Violations
ar: إزالة الإعلانات والانتهاكات

# appRemoveViolatingAds
source: The App reserves the right to remove ads that violate these policies without notice or refund.
ar: يحتفظ التطبيق بالحق في إزالة الإعلانات التي تنتهك هذه السياسات دون إشعار أو استرداد.

# repeatedViolationsBan
source: Repeated violations may result in a ban from advertising on the platform.
ar: الانتهاكات المتكررة قد تؤدي إلى حظر من الإعلان على المنصة.

source: Users must not:
ar: يجب على المستخدمين عدم:

# misrepresentServices
source: Misrepresent themselves or their services.
ar: تحريف أنفسهم أو خدماتهم.

# engageFraudulent
source: Engage in fraudulent activities.
ar: الانخراط في أنشطة احتيالية.

# violateLocalLaws
source: Violate any local, state, or national laws.
ar: انتهاك أي قوانين محلية أو إقليمية أو وطنية.

# useAppIllegalPurposes
source: Use the App for any illegal or unethical purposes.
ar: استخدام التطبيق لأي أغراض غير قانونية أو غير أخلاقية.

# disputesHandledBySupport
source: Any disputes between users must be handled through the App's customer support team.
ar: يجب التعامل مع أي نزاعات بين المستخدمين من خلال فريق دعم العملاء في التطبيق.

# appNotResponsibleDisagreements
source: The App is not responsible for any disagreements between customers and service providers but will assist in resolving disputes where possible.
ar: التطبيق غير مسؤول عن أي خلافات بين العملاء ومقدمي الخدمات ولكن سيساعد في حل النزاعات حيثما أمكن.

source: Service Provider Cancellation
ar: إلغاء مقدم الخدمة

# inform48HoursBefore
source: Service providers must inform the customer and the platform at least 48 hours before the scheduled service if they need to cancel.
ar: يجب على مقدمي الخدمات إبلاغ العميل والمنصة قبل 48 ساعة على الأقل من الخدمة المجدولة إذا كانوا بحاجة إلى الإلغاء.

source: Frequent Cancellations
ar: الإلغاءات المتكررة

# repeatedCancellationsPenalties
source: Repeated last-minute cancellations or no-shows may result in penalties, lower visibility in search results, or account suspension.
ar: الإلغاءات المتكررة في اللحظة الأخيرة أو عدم الحضور قد تؤدي إلى عقوبات أو انخفاض الرؤية في نتائج البحث أو تعليق الحساب.

source: Customer Compensation
ar: تعويض العميل

# providerCancelCompensation
source: If a service provider cancels after a customer has already made preparations (e.g., purchasing materials, rearranging schedules), compensation may be required.
ar: إذا ألغى مقدم الخدمة بعد أن قام العميل بالفعل بالتحضيرات (مثل شراء المواد، إعادة ترتيب الجداول)، فقد يكون التعويض مطلوباً.

source: Unavoidable Cancellations
ar: الإلغاءات التي لا يمكن تجنبها

# unforeseeableCircumstances
source: If a service provider must cancel due to unforeseen circumstances (e.g., health issues, family emergencies), they should notify support immediately to avoid penalties.
ar: إذا كان على مقدم الخدمة الإلغاء بسبب ظروف غير متوقعة (مثل المشاكل الصحية، حالات الطوارئ العائلية)، فيجب عليهم إخطار الدعم فوراً لتجنب العقوبات.

source: Free Cancellation Window
ar: نافزة الإلغاء المجاني

# customersFreeCancel48Hours
source: Customers can cancel a booking for free if done at least 48 hours before the scheduled service.
ar: يمكن للعملاء إلغاء الحجز مجاناً إذا تم ذلك قبل 48 ساعة على الأقل من الخدمة المجدولة.

source: Late Cancellations
ar: الإلغاءات المتأخرة

# lateCancellationFee
source: If a cancellation is made within 24 hours of the scheduled service, a cancellation fee of 20% of the paid amount may be charged.
ar: إذا تم الإلغاء خلال 24 ساعة من الخدمة المجدولة، فقد يتم فرض رسوم إلغاء بنسبة 20% من المبلغ المدفوع.

source: No-Shows
ar: عدم الحضور

# noShowFullCharge
source: If the customer fails to be present at the service location without prior cancellation, they may be charged the full service fee.
ar: إذا فشل العميل في التواجد في موقع الخدمة دون إلغاء مسبق، فقد يتم فرض رسوم الخدمة الكاملة عليه.

source: Refund Policy
ar: سياسة الاسترداد

# refundEligibilityDepends
source: Refund eligibility depends on the specific service provider's policy. In some cases, partial refunds may be issued after deducting applicable fees.
ar: أهلية الاسترداد تعتمد على سياسة مقدم الخدمة المحددة. في بعض الحالات، قد يتم إصدار استرداد جزئي بعد خصم الرسوم المعمول بها.

# reportUnforeseeableCircumstances
source: If a service is canceled by either party due to unforeseen circumstances, both the customer and the service provider should report the issue through the App to avoid penalties.
ar: إذا تم إلغاء الخدمة من قبل أي طرف بسبب ظروف غير متوقعة، فيجب على كل من العميل ومقدم الخدمة الإبلاغ عن المشكلة من خلال التطبيق لتجنب العقوبات.

# appModifyCancellationPolicies
source: The App reserves the right to modify cancellation policies and will notify users of significant changes.
ar: يحتفظ التطبيق بالحق في تعديل سياسات الإلغاء وسيخطر المستخدمين بالتغييرات المهمة.

# appSuspendTerminateViolations
source: The App reserves the right to suspend or terminate any account that violates these terms.
ar: يحتفظ التطبيق بالحق في تعليق أو إنهاء أي حساب ينتهك هذه الشروط.

# usersDeactivateAccounts
source: Users may deactivate their accounts at any time through the App settings.
ar: يمكن للمستخدمين إلغاء تنشيط حساباتهم في أي وقت من خلال إعدادات التطبيق.

# appPlatformConnect
source: The App acts as a platform to connect customers with service providers but does not guarantee service quality or outcomes.
ar: يعمل التطبيق كمنصة لربط العملاء بمقدمي الخدمات ولكن لا يضمن جودة الخدمة أو النتائج.

# appNotLiableUserInteractions
source: The App is not liable for any damages, losses, or disputes arising from user interactions.
ar: التطبيق غير مسؤول عن أي أضرار أو خسائر أو نزاعات ناشئة عن تفاعلات المستخدمين.

# appUpdateTermsAnytime
source: The App reserves the right to update these Terms and Conditions at any time. Users will be notified of significant changes.
ar: يحتفظ التطبيق بالحق في تحديث هذه الشروط والأحكام في أي وقت. سيتم إخطار المستخدمين بالتغييرات المهمة.

# continuedUseAcceptance
source: Continued use of the App after changes are posted constitutes acceptance of the new terms.
ar: الاستخدام المستمر للتطبيق بعد نشر التغييرات يشكل قبولاً للشروط الجديدة.

# contactSupportForQuestions
source: For questions or concerns regarding these Terms and Conditions, please contact our support team within the App.
ar: للأسئلة أو المخاوف بشأن هذه الشروط والأحكام، يرجى الاتصال بفريق الدعم داخل التطبيق.

# acknowledgmentReadUnderstood
source: By using Good One, you acknowledge that you have read, understood, and agreed to these Terms and Conditions.
ar: باستخدام Good One، فإنك تقر بأنك قد قرأت وفهمت ووافقت على هذه الشروط والأحكام.

source: Emergency Cancellations
ar: إلغاءات الطوارئ

# emergencyCancellationPolicy
source: If a cancellation is due to an emergency (e.g., medical issues, accidents), the customer must provide proof, and a full refund may be issued at the platform's discretion.
ar: إذا كان الإلغاء بسبب حالة طارئة (مثل المشاكل الطبية، الحوادث)، فيجب على العميل تقديم دليل، وقد يتم إصدار استرداد كامل حسب تقدير المنصة.

source: Advance Notice
ar: إشعار مسبق

source: Connecting to chat...
ar: الاتصال بالدردشة...

source: Loading messages...
ar: تحميل الرسائل...

source: Connecting...
ar: جاري الاتصال...

# startConversationWith
source: Start a conversation with
ar: ابدأ محادثة مع

source: Failed to initialize chat
ar: فشل في تهيئة الدردشة

source: Initializing chat...
ar: تهيئة الدردشة...

source: Loading conversations...
ar: تحميل المحادثات...

source: Unknown User
ar: مستخدم غير معروف

source: Welcome to our app
ar: مرحباً بك في تطبيقنا

# accountTypeSelectionPrompt
source: Please select your account type
ar: يرجى اختيار نوع حسابك

source: day
ar: يوم

source: Fixed Price
ar: سعر ثابت

source: Welcome to your bookings
ar: مرحباً بك في حجوزاتك

source: No active bookings
ar: لا توجد حجوزات نشطة

# noActiveBookingsMessage
source: You have no active bookings at the moment
ar: ليس لديك حجوزات نشطة في الوقت الحالي

source: No completed bookings
ar: لا توجد حجوزات مكتملة

# noCanceledBookingsMessage
source: You have no canceled bookings
ar: ليس لديك حجوزات ملغاة

source: No canceled bookings
ar: لا توجد حجوزات ملغاة

# startBookingPrompt
source: Start booking your services now
ar: ابدأ بحجز خدماتك الآن

source: Oops! Something went wrong
ar: عذراً! حدث خطأ ما

source: Pricing Type
ar: نوع التسعير

source: Hourly
ar: بالساعة

source: Daily
ar: يومي

source: Fixed
ar: ثابت

source: Additional
ar: إضافي

# additionalCostLabel
source: Additional Cost
ar: تكلفة إضافية

source: Date & Time
ar: التاريخ والوقت

source: Estimated Price
ar: السعر المقدر

source: Hourly Pricing
ar: التسعير بالساعة

source: Daily Pricing
ar: التسعير اليومي

source: Fixed Pricing
ar: التسعير الثابت

source: Pricing
ar: التسعير

source: Charged at
ar: يُحتسب بـ

source: Select hours needed
ar: اختر الساعات المطلوبة

source: Select days needed
ar: اختر الأيام المطلوبة

source: Fixed price of
ar: سعر ثابت قدره

source: for complete service
ar: للخدمة الكاملة

source: Service pricing information
ar: معلومات تسعير الخدمة

source: Complete service fixed price
ar: سعر ثابت للخدمة الكاملة

source: Confirmed
ar: مؤكد

source: Clear Filters
ar: مسح المرشحات

source: All Reviews
ar: جميع التقييمات

source: Reviews
ar: التقييمات

source: Default Order
ar: الترتيب الافتراضي

source: Highest Rating
ar: أعلى تقييم

source: Lowest Price
ar: أقل سعر

source: Highest Price
ar: أعلى سعر

source: Most Popular
ar: الأكثر شعبية

source: Hourly Services First
ar: الخدمات بالساعة أولاً

source: Daily Services First
ar: الخدمات اليومية أولاً

source: Fixed Price First
ar: السعر الثابت أولاً

source: Sort By
ar: ترتيب حسب

source: Hourly Services
ar: الخدمات بالساعة

source: Daily Services
ar: الخدمات اليومية

source: Fixed Price Services
ar: خدمات السعر الثابت

source: Mark All as Read
ar: تعيين الكل كمقروء

source: All notifications marked as read
ar: تم تعيين جميع الإشعارات كمقروءة

source: Failed to mark as read
ar: فشل في التعيين كمقروء

source: Loading notifications...
ar: تحميل الإشعارات...

source: Error loading notifications
ar: خطأ في تحميل الإشعارات

source: Unknown error occurred
ar: حدث خطأ غير معروف

# noNotificationsMessage
source: No notifications available
ar: لا توجد إشعارات متاحة

source: Refresh
ar: تحديث

# newLabel
source: NEW
ar: جديد

source: Notification opened
ar: تم فتح الإشعار

source: Error opening notification
ar: خطأ في فتح الإشعار

source: Minimum Ratings
ar: الحد الأدنى للتقييمات

source: Ratings
ar: التقييمات

# filterAndSort
source: Filter & Sort
ar: مرشح وترتيب

source: Price Range
ar: نطاق السعر

source: Edit/Update Service Details
ar: تحرير/تحديث تفاصيل الخدمة

source: Service Visibility
ar: رؤية الخدمة

source: Service is active
ar: الخدمة نشطة

source: Service is inactive
ar: الخدمة غير نشطة

# customersCanSeeAndBook
source: Customers can see and book this service
ar: يمكن للعملاء رؤية وحجز هذه الخدمة

# serviceHiddenFromCustomers
source: Service is hidden from customers
ar: الخدمة مخفية عن العملاء

source: Unsaved Changes
ar: تغييرات غير محفوظة

source: Service Details
ar: تفاصيل الخدمة

source: Certificate
ar: شهادة

source: Upload Certificate
ar: رفع شهادة

source: Set Price Per Hour
ar: تحديد السعر في الساعة

source: Daily Rate
ar: المعدل اليومي

source: Set Price Per Day
ar: تحديد السعر في اليوم

source: One-time Service Price
ar: سعر الخدمة لمرة واحدة

source: Service Gallery
ar: معرض الخدمة

source: No images yet
ar: لا توجد صور بعد

# addPhotosToShowcase
source: Add photos to showcase your work
ar: أضف صوراً لعرض عملك

source: Failed to load
ar: فشل في التحميل

source: Updating...
ar: جاري التحديث...

source: Update failed
ar: فشل التحديث

source: Service updated successfully
ar: تم تحديث الخدمة بنجاح

source: Add Certificate
ar: إضافة شهادة

source: Add Photo
ar: إضافة صورة

source: Use Your Camera
ar: استخدم الكاميرا

source: Select from Gallery
ar: اختر من المعرض

source: Try Again
ar: حاول مرة أخرى

source: No orders yet
ar: لا توجد طلبات بعد

# ordersFromCustomersWillAppear
source: Orders from customers will appear here
ar: ستظهر طلبات العملاء هنا

source: No orders
ar: لا توجد طلبات

source: No orders scheduled for
ar: لا توجد طلبات مجدولة لـ

source: Cost per day
ar: التكلفة في اليوم

source: Service Type
ar: نوع الخدمة

source: Fixed Price Service
ar: خدمة بسعر ثابت

source: Fixed Rate
ar: معدل ثابت

source: Creating...
ar: جاري الإنشاء...

source: Service visible to customers
ar: الخدمة مرئية للعملاء

# canChangeAnytimeAfterCreating
source: You can change this anytime after creating the service
ar: يمكنك تغيير هذا في أي وقت بعد إنشاء الخدمة

# createFirstServicePrompt
source: Create your first service to get started
ar: أنشئ خدمتك الأولى للبدء

source: Active
ar: نشط

# freeCancellationDescription
source: Customers can cancel a booking for free if done at least 48 hours before the scheduled service.
ar: يمكن للعملاء إلغاء الحجز مجاناً إذا تم ذلك قبل 48 ساعة على الأقل من موعد الخدمة المجدولة.

# lateCancellationDescription
source: If a cancellation is made within 24 hours of the scheduled service, a cancellation fee of 20% of the paid amount may be charged.
ar: إذا تم الإلغاء خلال 24 ساعة من موعد الخدمة المجدولة، قد يتم فرض رسوم إلغاء بنسبة 20% من المبلغ المدفوع.

# noShowDescription
source: If the customer fails to be present at the service location without prior cancellation, they may be charged the full service fee.
ar: إذا فشل العميل في التواجد في موقع الخدمة دون إلغاء مسبق، قد يتم تحصيل كامل رسوم الخدمة.

# refundPolicyDescription
source: Refund eligibility depends on the specific service provider's policy. In some cases, partial refunds may be issued after deducting applicable fees.
ar: أهلية الاسترداد تعتمد على سياسة مقدم الخدمة المحددة. في بعض الحالات، قد يتم إصدار استرداد جزئي بعد خصم الرسوم المطبقة.

# emergencyCancellationDescription
source: If a cancellation is due to an emergency (e.g., medical issues, accidents), the customer must provide proof, and a full refund may be issued at the platform's discretion.
ar: إذا كان الإلغاء بسبب حالة طارئة (مثل المشاكل الطبية أو الحوادث)، يجب على العميل تقديم إثبات، وقد يتم إصدار استرداد كامل حسب تقدير المنصة.

# advanceNoticeDescription
source: Service providers must inform the customer and the platform at least 48 hours before the scheduled service if they need to cancel.
ar: يجب على مقدمي الخدمة إبلاغ العميل والمنصة قبل 48 ساعة على الأقل من موعد الخدمة المجدولة إذا احتاجوا للإلغاء.

# frequentCancellationDescription
source: Repeated last-minute cancellations or no-shows may result in penalties, lower visibility in search results, or account suspension.
ar: الإلغاءات المتكررة في اللحظة الأخيرة أو عدم الحضور قد يؤدي إلى عقوبات أو انخفاض الظهور في نتائج البحث أو تعليق الحساب.

# customerCompensationDescription
source: If a service provider cancels after a customer has already made preparations (e.g., purchasing materials, rearranging schedules), compensation may be required.
ar: إذا ألغى مقدم الخدمة بعد أن أجرى العميل تحضيرات مسبقة (مثل شراء المواد أو إعادة ترتيب الجداول)، قد يكون التعويض مطلوباً.

# unavoidableCancellationDescription
source: If a service provider must cancel due to unforeseen circumstances (e.g., health issues, family emergencies), they should notify support immediately to avoid penalties.
ar: إذا اضطر مقدم الخدمة للإلغاء بسبب ظروف غير متوقعة (مثل المشاكل الصحية أو طوارئ عائلية)، يجب عليه إخطار الدعم فوراً لتجنب العقوبات.

# generalRulesDescription1
source: If a service is canceled by either party due to unforeseen circumstances, both the customer and the service provider should report the issue through the App to avoid penalties.
ar: إذا تم إلغاء الخدمة من قبل أي طرف بسبب ظروف غير متوقعة، يجب على كل من العميل ومقدم الخدمة الإبلاغ عن المشكلة من خلال التطبيق لتجنب العقوبات.

# generalRulesDescription2
source: The App reserves the right to modify cancellation policies and will notify users of significant changes.
ar: يحتفظ التطبيق بالحق في تعديل سياسات الإلغاء وسيقوم بإشعار المستخدمين بالتغييرات المهمة.

source: Personal Information
ar: المعلومات الشخصية

# personalInformationDescription
source: We collect information such as your name, email address, and phone number when you use our app.
ar: نجمع معلومات مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك عند استخدام تطبيقنا.

source: Location Information
ar: معلومات الموقع

# locationInformationDescription
source: If location services are enabled, we collect geographic data to enhance your user experience.
ar: إذا كانت خدمات الموقع مفعلة، نجمع البيانات الجغرافية لتحسين تجربة المستخدم.

source: Device Information
ar: معلومات الجهاز

# deviceInformationDescription
source: We collect details like device type, operating system, and IP address.
ar: نجمع تفاصيل مثل نوع الجهاز ونظام التشغيل وعنوان IP.

source: Usage Data
ar: بيانات الاستخدام

# usageDataDescription
source: We gather data on how you interact with the app to improve our services.
ar: نجمع بيانات حول كيفية تفاعلك مع التطبيق لتحسين خدماتنا.

source: Service Improvement
ar: تحسين الخدمة

# serviceImprovementDescription
source: We use your data to enhance and personalize app services.
ar: نستخدم بياناتك لتحسين وتخصيص خدمات التطبيق.

# notificationsUsage
source: Notifications
ar: الإشعارات

# notificationsUsageDescription
source: We send notifications and service-related alerts to keep you informed.
ar: نرسل إشعارات وتنبيهات متعلقة بالخدمة لإبقائك على اطلاع.

# communicationUsage
source: Communication
ar: التواصل

# communicationUsageDescription
source: We use your data to process requests and communicate with you.
ar: نستخدم بياناتك لمعالجة الطلبات والتواصل معك.

source: Legal Compliance
ar: الامتثال القانوني

# legalComplianceDescription
source: We ensure compliance with legal and regulatory requirements.
ar: نضمن الامتثال للمتطلبات القانونية والتنظيمية.

source: Service Providers
ar: مقدمو الخدمات

# serviceProvidersDescription
source: We may share your data with payment processors, analytics providers, and technical support companies.
ar: قد نشارك بياناتك مع معالجات الدفع ومقدمي التحليلات وشركات الدعم التقني.

# legalComplianceSharing
source: Legal Compliance
ar: الامتثال القانوني

# legalComplianceSharingDescription
source: We may share data if required by law or to protect our rights.
ar: قد نشارك البيانات إذا كان ذلك مطلوباً بموجب القانون أو لحماية حقوقنا.

source: Advertising Partners
ar: شركاء الإعلان

# advertisingPartnersDescription
source: With your consent, we may share some data for marketing purposes.
ar: بموافقتك، قد نشارك بعض البيانات لأغراض التسويق.
