Repository: lahcenegue/good_one_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Retry
ar: إعادة المحاولة

# networkError
source: Please check your internet connection and try again
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى

# generalError
source: Something went wrong. Please try again.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى.

source: Log in
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

# enterEmail
source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Password
ar: كلمة المرور

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

# forgotPassword
source: Forgot your password?
ar: نسيت كلمة المرور؟

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

# createAccount
source: Create your account now
ar: أنشئ حسابك الآن

source: Profile Picture
ar: صورة الملف الشخصي

source: Take Photo
ar: التقاط صورة

source: Choose from Gallery
ar: اختيار من المعرض

source: Full Name
ar: الاسم الكامل

# enterFullName
source: Enter your full name
ar: أدخل اسمك الكامل

source: Phone Number
ar: رقم الهاتف

# enterPhoneNumber
source: Enter your phone number
ar: أدخل رقم هاتفك

source: Retype Password
ar: إعادة كتابة كلمة المرور

# hasAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# loginToContinue
source: Please log in to continue
ar: يرجى تسجيل الدخول للمتابعة

source: Back
ar: رجوع

source: Cancellation Policy
ar: سياسة الإلغاء

source: Cancellation Policy for Customers
ar: سياسة الإلغاء للعملاء

source: Cancellation Policy for Service Providers
ar: سياسة الإلغاء لمقدمي الخدمات

source: General Rules
ar: القواعد العامة

source: Language
ar: اللغة

source: Save
ar: حفظ

source: Support
ar: الدعم

# supportHeader
source: How Can We Assist You?
ar: كيف يمكننا مساعدتك؟

source: Email Support
ar: دعم البريد الإلكتروني

# emailSupportDescription
source: Reach out to our team via email for assistance.
ar: تواصل مع فريقنا عبر البريد الإلكتروني للحصول على المساعدة.

# chatSupport
source: Live Chat Support
ar: دعم الدردشة المباشرة

# chatSupportDescription
source: Connect with a support agent in real-time.
ar: تواصل مع وكيل الدعم في الوقت الفعلي.

# whatsappSupport
source: Contact via WhatsApp
ar: التواصل عبر واتساب

# whatsappSupportDescription
source: Message us on WhatsApp for quick support.
ar: راسلنا على واتساب للحصول على دعم سريع.

source: Terms and Conditions
ar: الشروط والأحكام

# termsAndConditionsDescription
source: View the terms and conditions of using the Good One app.
ar: عرض شروط وأحكام استخدام تطبيق Good One.

# cancellationPolicyDescription
source: Review our policy on cancellations and refunds.
ar: راجع سياستنا حول الإلغاءات والمبالغ المستردة.

source: Delete Account
ar: حذف الحساب

# deleteAccountDescription
source: Permanently delete your account and data.
ar: حذف حسابك وبياناتك نهائياً.

# deleteAccountConfirmation
source: Are you sure you want to delete your account? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف حسابك؟ لا يمكن التراجع عن هذا الإجراء.

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Introduction
ar: المقدمة

source: Definitions
ar: التعريفات

source: User Eligibility
ar: أهلية المستخدم

source: Account Registration and Use
ar: تسجيل الحساب والاستخدام

source: Communication and Privacy
ar: التواصل والخصوصية

source: Payments and Transactions
ar: المدفوعات والمعاملات

source: Service Provider Requirements
ar: متطلبات مقدم الخدمة

source: Advertising Policy
ar: سياسة الإعلان

source: Prohibited Activities
ar: الأنشطة المحظورة

source: Dispute Resolution
ar: حل النزاعات

source: Termination and Suspension
ar: الإنهاء والتعليق

source: Liability and Disclaimers
ar: المسؤولية وإخلاء المسؤولية

source: Changes to Terms
ar: تغييرات الشروط

source: Contact Information
ar: معلومات التواصل

# onboardingDesc1
source: Discover quick and easy solutions for all your home needs, from plumbing and electrical to cleaning and renovation. Let us make your home more comfortable.
ar: اكتشف حلولاً سريعة وسهلة لجميع احتياجات منزلك، من السباكة والكهرباء إلى التنظيف والتجديد. دعنا نجعل منزلك أكثر راحة.

# onboardingDesc2
source: We offer a comprehensive range of high-quality, reliable home services, so you can enjoy your time at home without any worries.
ar: نحن نقدم مجموعة شاملة من الخدمات المنزلية عالية الجودة والموثوقة، حتى تتمكن من الاستمتاع بوقتك في المنزل دون أي قلق.

# onboardingTitle1
source: Home services with a professional touch!
ar: خدمات منزلية باللمسة المهنية!

# onboardingTitle2
source: We're here to make your life easier!
ar: نحن هنا لنجعل حياتك أسهل!

source: Skip
ar: تخطي

source: Next
ar: التالي

# languageSelectionTitle
source: Language selection
ar: اختيار اللغة

# welcomeMessage
source: Welcome to
ar: مرحباً بك في

# chooseLanguagePrompt
source: Choose your language to start
ar: اختر لغتك للبدء

source: Booking
ar: الحجز

source: In progress
ar: قيد التنفيذ

source: Completed
ar: مكتمل

source: Canceled
ar: ملغى

source: No bookings
ar: لا توجد حجوزات

source: Unknown status
ar: حالة غير معروفة

source: Confirm Service
ar: تأكيد الخدمة

# hasServiceBeenReceived
source: Has the service been completed?
ar: هل تم إنجاز الخدمة؟

source: Not Yet
ar: ليس بعد

source: Confirm
ar: تأكيد

source: Status
ar: الحالة

source: Service
ar: الخدمة

source: Location
ar: الموقع

source: Time
ar: الوقت

source: Price
ar: السعر

source: hour
ar: ساعة

source: hours
ar: ساعات

source: Total
ar: المجموع

source: Cancel Booking
ar: إلغاء الحجز

source: Reason for Cancellation
ar: سبب الإلغاء

# enterReason
source: Enter your reason here...
ar: أدخل سببك هنا...

source: Close
ar: إغلاق

# reasonRequired
source: Please provide a reason for cancellation.
ar: يرجى تقديم سبب للإلغاء.

source: Submit
ar: إرسال

source: Start Date
ar: تاريخ البداية

source: Start Time
ar: وقت البداية

source: Duration
ar: المدة

source: Additional Payment Required
ar: مطلوب دفع إضافي

# additionalHours
source: Additional hours: {hours}
ar: ساعات إضافية: {hours}

# additionalCost
source: Additional cost: ${cost}
ar: تكلفة إضافية: ${cost}

source: Booking Summary
ar: ملخص الحجز

source: Booking Details
ar: تفاصيل الحجز

source: Date
ar: التاريخ

source: No location specified
ar: لم يتم تحديد الموقع

# couponsAndOffers
source: Coupons & Offers
ar: القسائم والعروض

# typeCouponCodeHere
source: Type your coupon code here...
ar: اكتب رمز القسيمة هنا...

source: Apply
ar: تطبيق

# couponApplied
source: Coupon: ({coupon}), discount ({discount}%)
ar: القسيمة: ({coupon})، الخصم ({discount}%)

source: Price Summary
ar: ملخص السعر

source: Hourly Rate
ar: السعر بالساعة

source: Subtotal
ar: المجموع الفرعي

source: Discount
ar: الخصم

source: Total Amount
ar: المبلغ الإجمالي

source: Schedule
ar: جدولة

# selectValidTimeSlot
source: Please select a valid future time slot
ar: يرجى اختيار فترة زمنية صالحة في المستقبل

source: Search City Or Place
ar: البحث عن مدينة أو مكان

source: Confirm This Location
ar: تأكيد هذا الموقع

source: Selected Location on Map
ar: الموقع المحدد على الخريطة

source: Hello
ar: مرحباً

source: Search
ar: بحث

source: Our services
ar: خدماتنا

source: See all
ar: عرض الكل

source: Best Contractors
ar: أفضل المقاولين

source: Home
ar: الرئيسية

source: Services
ar: الخدمات

source: Profile
ar: الملف الشخصي

source: Chat
ar: المحادثة

source: Book
ar: احجز

source: Confird
ar: مؤكد

source: With Lisence
ar: مع ترخيص

source: Years of Experience
ar: سنوات الخبرة

source: Rating
ar: التقييم

source: Clients
ar: العملاء

source: About
ar: حول

source: Photo album
ar: ألبوم الصور

source: Customer reviews
ar: تقييمات العملاء

source: Rate Service
ar: قيم الخدمة

source: Rate Your Experience
ar: قيم تجربتك

source: Comment
ar: تعليق

# commentHint
source: Share your feedback...
ar: شارك رأيك...

source: No Services Available
ar: لا توجد خدمات متاحة

source: Account Details
ar: تفاصيل الحساب

source: Update
ar: تحديث

source: Notifications
ar: الإشعارات

# noNotifications
source: No notifications available
ar: لا توجد إشعارات متاحة

source: Pull down to refresh
ar: اسحب لأسفل للتحديث

source: Today
ar: اليوم

source: Earlier
ar: سابقاً

# privacyPolicy
source: Privacy and Policy
ar: الخصوصية والسياسة

source: Logout
ar: تسجيل الخروج

source: Orders
ar: الطلبات

source: Edit
ar: تحرير

source: Edit Service Details
ar: تحرير تفاصيل الخدمة

source: Select Service Category
ar: اختر فئة الخدمة

source: Select Subcategory
ar: اختر الفئة الفرعية

source: Service Description
ar: وصف الخدمة

source: Provide Detailed Description
ar: قدم وصفاً مفصلاً

source: Service Price Per Hour
ar: سعر الخدمة في الساعة

source: Enter Price
ar: أدخل السعر

source: Enter Experience Years
ar: أدخل سنوات الخبرة

source: Do You Have Certificate?
ar: هل لديك شهادة؟

source: Upload Your Certificate
ar: ارفع شهادتك

source: Manage Service Images
ar: إدارة صور الخدمة

source: My Orders
ar: طلباتي

source: Something Went Wrong
ar: حدث خطأ ما

source: No Orders Available
ar: لا توجد طلبات متاحة

source: No Orders For This Date
ar: لا توجد طلبات لهذا التاريخ

# ordersDetails
source: Order Details
ar: تفاصيل الطلب

source: Order Summary
ar: ملخص الطلب

source: Created At
ar: تم إنشاؤه في

source: Total Hours
ar: إجمالي الساعات

source: Cost Per Hour
ar: التكلفة في الساعة

source: Total Price
ar: السعر الإجمالي

source: Chat With Customer
ar: محادثة مع العميل

source: Note
ar: ملاحظة

source: Delivery Location
ar: موقع التسليم

source: Complete
ar: مكتمل

source: Cancel Order
ar: إلغاء الطلب

source: Withdrawal Status
ar: حالة السحب

# statusSent
source: Sent
ar: تم الإرسال

# statusWaitingToSend
source: Waiting to Send
ar: في انتظار الإرسال

# statusRequestReceived
source: Request Received
ar: تم استلام الطلب

source: Unknown
ar: غير معروف

source: City
ar: المدينة

# enterCity
source: Enter Your City
ar: أدخل مدينتك

source: Country
ar: الدولة

# enterCountry
source: Enter Your Country
ar: أدخل دولتك

source: Add Service
ar: إضافة خدمة

source: Define Your Service Expertise
ar: حدد خبرتك في الخدمة

source: Choose Service Category
ar: اختر فئة الخدمة

source: Choose Subcategory
ar: اختر الفئة الفرعية

# descriptionRequired
source: Description is required
ar: الوصف مطلوب

# priceRequired
source: Price is required
ar: السعر مطلوب

# experienceRequired
source: Experience is required
ar: الخبرة مطلوبة

source: Wallet
ar: المحفظة

# withdrawal
source: Withdraw
ar: سحب

source: Service Summary
ar: ملخص الخدمة

source: On Vacation
ar: في إجازة

source: Available
ar: متاح

source: Return To Work
ar: العودة للعمل

source: Go On Vacation
ar: الذهاب في إجازة

source: Security Check
ar: الفحص الأمني

source: Security Check Completed
ar: تم إكمال الفحص الأمني

source: Security Check Pending
ar: الفحص الأمني قيد الانتظار

source: Complete Security Check
ar: إكمال الفحص الأمني

source: Request Status
ar: حالة الطلب

source: Services Provided
ar: الخدمات المقدمة

source: Visible
ar: مرئي

source: Inactive
ar: غير نشط

source: Bank Account
ar: الحساب المصرفي

# fullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# invalidCoupon
source: Invalid coupon code
ar: رمز الكوبون غير صالح

# invalidEmail
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح

# passwordTooShort
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# confirmPasswordRequired
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# locationRequired
source: Your city and country are required
ar: المدينة والدولة مطلوبتان

# orderSuccessTitle
source: Order Created Successfully
ar: تم إنشاء الطلب بنجاح

# orderSuccessDescription
source: Your booking has been confirmed. You can view it in your bookings.
ar: تم تأكيد حجزك. يمكنك عرضه في حجوزاتك.

# feedbackSuccessTitle
source: Thank You for Your Feedback!
ar: شكراً لك على ملاحظاتك!

# feedbackSuccessDescription
source: Your rating has been submitted successfully.
ar: تم إرسال تقييمك بنجاح.

source: Back to Bookings
ar: العودة إلى الحجوزات

# submissionFailed
source: Failed to submit feedback
ar: فشل في إرسال الملاحظات

source: Pending
ar: قيد الانتظار

source: Select Country
ar: اختر الدولة

source: Select City
ar: اختر المدينة

source: Support Request from App
ar: طلب دعم من التطبيق

# iNeedAssistance
source: Hello, I need assistance with...
ar: مرحباً، أحتاج مساعدة في...

# emailCopied
source: Email copied to clipboard
ar: تم نسخ البريد الإلكتروني إلى الحافظة

# unableOpenWhatsApp
source: Unable to open WhatsApp
ar: غير قادر على فتح الواتساب

source: Error opening WhatsApp
ar: خطأ في فتح الواتساب

# typeMessage
source: Type a message...
ar: اكتب رسالة...

source: No messages yet
ar: لا توجد رسائل بعد

source: Messages
ar: الرسائل

# newMessage
source: NEW
ar: جديد

# noConversations
source: No conversations yet
ar: لا توجد محادثات بعد

# startNewConversation
source: Start a new conversation
ar: ابدأ محادثة جديدة

source: Modify Booking
ar: تعديل الحجز

# startTimeFuture
source: Start time must be in the future
ar: يجب أن يكون وقت البداية في المستقبل

# endTimeBetween
source: End time must be between 6:00 and 22:00
ar: يجب أن يكون وقت الانتهاء بين 6:00 و 22:00

source: No contractor selected
ar: لم يتم اختيار مقاول

source: Region Taxes
ar: الضرائب الإقليمية

source: Platform Fee
ar: رسوم المنصة

source: Task Duration
ar: مدة المهمة

source: User data not available
ar: بيانات المستخدم غير متاحة

# invalidPhone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

# uploadImages
source: Please upload unique images to attract customers
ar: يرجى رفع صور فريدة لجذب العملاء

# additionalPhotos
source: Additional photos of the service
ar: صور إضافية للخدمة

# chooseMoreImage
source: You can choose more than one image for the service
ar: يمكنك اختيار أكثر من صورة واحدة للخدمة

source: Add images
ar: إضافة صور

source: Image
ar: صورة

# notLaunchGoogleMaps
source: Could not launch Google Maps.
ar: لا يمكن تشغيل خرائط جوجل.

source: Order
ar: طلب

# unableLoadMap
source: Unable to load map.
ar: غير قادر على تحميل الخريطة.

source: Data We Collect
ar: البيانات التي نجمعها

# howWeUseData
source: How We Use the Data
ar: كيف نستخدم البيانات

# sharingData
source: Sharing Data with Third Parties
ar: مشاركة البيانات مع أطراف ثالثة

source: User Rights
ar: حقوق المستخدم

source: Data Protection
ar: حماية البيانات

# changesToPolicy
source: Changes to the Privacy Policy
ar: التغييرات على سياسة الخصوصية

source: Contact Us
ar: اتصل بنا

# privacyPolicyDescription
source: View our Privacy Policy to understand how we collect, use, and protect your personal data.
ar: اطلع على سياسة الخصوصية لفهم كيفية جمع واستخدام وحماية بياناتك الشخصية.

source: no Recent Withdrawals
ar: لا توجد عمليات سحب حديثة

# checkBackLaterUpdates
source: check BackLater For Updates
ar: راجع لاحقاً للحصول على التحديثات

source: Amount
ar: المبلغ

source: Worker
ar: العامل

source: Unknown time
ar: وقت غير معروف

source: Total Services
ar: إجمالي الخدمات

source: Transit
ar: في الطريق

source: Institution
ar: المؤسسة

source: Account
ar: الحساب

source: Withdrawal request submitted
ar: تم إرسال طلب السحب

source: No Service Found
ar: لم يتم العثور على خدمة

# searchServices
source: Search for a service...
ar: البحث عن خدمة...

source: Search Results
ar: نتائج البحث

# resetPasswordEnterEmail
source: Please enter your registered email address, and we will send you a verification code (OTP) to reset your password.
ar: يرجى إدخال عنوان البريد الإلكتروني المسجل، وسنرسل لك رمز التحقق (OTP) لإعادة تعيين كلمة المرور.

source: OTP Verification
ar: التحقق من OTP

# enterVerificationCode
source: Enter the verification code (OTP)
ar: أدخل رمز التحقق (OTP)

# otpSent
source: We have sent a 6-digit verification code to your registered contact.
ar: لقد أرسلنا رمز تحقق مكون من 6 أرقام إلى جهة الاتصال المسجلة.

# checkCode
source: Check the code
ar: تحقق من الرمز

# resendCode
source: Resend the code
ar: إعادة إرسال الرمز

source: No contractors found
ar: لم يتم العثور على مقاولين

# noContractorsMatchFilters
source: No contractors match the current filters.
ar: لا يوجد مقاولون يطابقون المرشحات الحالية.

# noContractorsAvailableInThisCategory
source: No contractors are currently available in this category.
ar: لا يوجد مقاولون متاحون حالياً في هذه الفئة.

source: Chat Connection Failed
ar: فشل الاتصال بالدردشة

source: Waiting For User Info
ar: في انتظار معلومات المستخدم

source: Connected
ar: متصل

source: Reconnect
ar: إعادة الاتصال

# checkConnection
source: Please check your internet connection
ar: يرجى التحقق من اتصال الإنترنت

source: Bank Account Information
ar: معلومات الحساب المصرفي

# interacTransferInformation
source: Interac e-Transfer Information
ar: معلومات التحويل الإلكتروني Interac

# interacMessage
source: Funds will be sent to this email address via Interac e-Transfer.
ar: سيتم إرسال الأموال إلى عنوان البريد الإلكتروني هذا عبر التحويل الإلكتروني Interac.

# saveAccount
source: Save account information for future use
ar: حفظ معلومات الحساب للاستخدام المستقبلي

source: Processing...
ar: جاري المعالجة...

# requiredFields
source: Please fill in all required fields correctly.
ar: يرجى ملء جميع الحقول المطلوبة بشكل صحيح.

source: Select Duration Type
ar: اختر نوع المدة

source: Days
ar: أيام

# taskBased
source: Task
ar: مهمة

# enterHours
source: Enter Number of Hours
ar: أدخل عدد الساعات

# enterDays
source: Enter Number of Days
ar: أدخل عدد الأيام

source: Enter Duration
ar: أدخل المدة

# exampleHours
source: e.g. 2.5
ar: مثال 2.5

# exampleDays
source: e.g. 1.5
ar: مثال 1.5

# hoursUnit
source: hrs
ar: ساعة

# daysUnit
source: days
ar: أيام

source: Quick Select
ar: اختيار سريع

source: Total Days
ar: إجمالي الأيام

source: Fixed Task Price
ar: سعر المهمة الثابت

# oneHourService
source: One hour service at hourly rate
ar: خدمة ساعة واحدة بالمعدل بالساعة

# taskBasedInfo
source: Fixed price task - charged at hourly rate for one hour of service
ar: مهمة بسعر ثابت - يتم فرض رسوم بالمعدل بالساعة لساعة واحدة من الخدمة

# taskPrice
source: Enter Task Price
ar: أدخل سعر المهمة

# exampleTaskPrice
source: e.g. 150.00
ar: مثال 150.00

source: Pricing Options
ar: خيارات التسعير

source: service Rate
ar: معدل الخدمة

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Reset Your Password
ar: إعادة تعيين كلمة المرور

# enterOtpAndNewPassword
source: Enter the verification code sent to your email and create a new password for your account.
ar: أدخل رمز التحقق المرسل إلى بريدك الإلكتروني وأنشئ كلمة مرور جديدة لحسابك.

source: Verification Code
ar: رمز التحقق

source: New Password
ar: كلمة المرور الجديدة

# enterNewPassword
source: Enter your new password
ar: أدخل كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

# confirmNewPassword
source: Confirm your new password
ar: أكد كلمة المرور الجديدة

# otpRequired
source: Verification code is required
ar: رمز التحقق مطلوب

# passwordResetSuccess
source: Password reset successfully! Please log in with your new password.
ar: تم إعادة تعيين كلمة المرور بنجاح! يرجى تسجيل الدخول بكلمة المرور الجديدة.

# termsIntroduction
source: Last Updated: 15 April 2025\n\nWelcome to Good One. These Terms and Conditions govern your use of our mobile application and services. By using our app, you agree to comply with these terms. If you do not agree, please do not use the app.
ar: آخر تحديث: 15 أبريل 2025\n\nمرحباً بك في Good One. تحكم هذه الشروط والأحكام استخدامك لتطبيقنا المحمول وخدماتنا. باستخدام تطبيقنا، فإنك توافق على الامتثال لهذه الشروط. إذا كنت لا توافق، يرجى عدم استخدام التطبيق.

# appDefinition
source: Refers to Good One app, the mobile application that connects customers with service providers.
ar: يشير إلى تطبيق Good One، التطبيق المحمول الذي يربط العملاء بمقدمي الخدمات.

# userDefinition
source: Refers to anyone who accesses and uses the App, including both customers and service providers.
ar: يشير إلى أي شخص يصل ويستخدم التطبيق، بما في ذلك العملاء ومقدمي الخدمات.

# customerDefinition
source: Refers to individuals seeking services through the App.
ar: يشير إلى الأفراد الذين يطلبون الخدمات من خلال التطبيق.

# serviceProviderDefinition
source: Refers to individuals offering their services through the App.
ar: يشير إلى الأفراد الذين يقدمون خدماتهم من خلال التطبيق.

# platformDefinition
source: Refers to the App and its associated services.
ar: يشير إلى التطبيق والخدمات المرتبطة به.

# toUseTheApp
source: To use the App, you must:
ar: لاستخدام التطبيق، يجب عليك:

# provideAccurateInfo
source: Provide accurate and truthful information during registration.
ar: تقديم معلومات دقيقة وصادقة أثناء التسجيل.

# complyWithLaws
source: Comply with all applicable laws and regulations.
ar: الامتثال لجميع القوانين واللوائح المعمول بها.

# ageRequirement
source: Be at least 18 years old to register as a service provider. Minors under 18 are required to provide parents' consent to confirm that the service will be under the parent's responsibility and supervision.
ar: أن تكون عمرك 18 عاماً على الأقل للتسجيل كمقدم خدمة. القُصّر تحت سن 18 مطلوب منهم تقديم موافقة الوالدين لتأكيد أن الخدمة ستكون تحت مسؤولية وإشراف الوالدين.

# minimumWorkingAgeByProvince
source: Minimum Working Age by Province/Territory
ar: الحد الأدنى لسن العمل حسب المقاطعة/الإقليم

# mostProvincesSet14Minimum
source: Most provinces set 14 as the minimum age for general work with restrictions.
ar: معظم المقاطعات تحدد 14 كحد أدنى للعمل العام مع قيود.

# someProvinces12YearOlds
source: Some provinces allow 12-year-olds to work in specific, non-hazardous jobs with parental consent.
ar: بعض المقاطعات تسمح للأطفال بعمر 12 سنة بالعمل في وظائف محددة وغير خطيرة بموافقة الوالدين.

# restrictionsWorkMinors
source: Restrictions on Work for Minors
ar: قيود العمل للقُصّر

source: No hazardous work
ar: لا عمل خطير

# minorsCannotDangerousJobs
source: Minors cannot perform dangerous jobs (e.g., construction, heavy machinery, electrical work).
ar: لا يمكن للقُصّر القيام بأعمال خطيرة (مثل البناء، الآلات الثقيلة، الأعمال الكهربائية).

source: Parental consent
ar: موافقة الوالدين

# provincesRequireParentalPermission
source: Many provinces require parental permission for those under 16.
ar: العديد من المقاطعات تتطلب إذن الوالدين لمن هم دون سن 16.

source: Limited work hours
ar: ساعات عمل محدودة

# kidsNoLateHours
source: Kids under 18 usually can't work late hours or during school time.
ar: الأطفال تحت سن 18 عادة لا يمكنهم العمل في ساعات متأخرة أو أثناء وقت المدرسة.

source: Business licensing issues
ar: قضايا ترخيص الأعمال

# provincesRestrictMinors
source: Some provinces may restrict minors from operating as independent contractors.
ar: بعض المقاطعات قد تقيد القُصّر من العمل كمقاولين مستقلين.

# specificCasesGigWork
source: Specific Cases for Gig Work (Your App's Context)
ar: حالات محددة للعمل المؤقت (سياق تطبيقك)

# servicesInvolvePhysicalLabor
source: The App provides services often involve physical labor, handyman work, and home services.
ar: يوفر التطبيق خدمات غالباً ما تتضمن عملاً بدنياً وأعمال صيانة وخدمات منزلية.

# jobsRequire18Plus
source: These types of jobs typically require workers to be 18+ because they involve safety risks, contracts, and potential liability issues.
ar: هذه الأنواع من الوظائف عادة تتطلب عمال بعمر 18+ لأنها تنطوي على مخاطر أمنية وعقود وقضايا مسؤولية محتملة.

# conclusionMinorsAllowed
source: Conclusion: Should Minors Be Allowed on the App?
ar: الخلاصة: هل يجب السماح للقُصّر بالتطبيق؟

# bestRequire18
source: It's best to require service providers to be at least 18.
ar: من الأفضل مطالبة مقدمي الخدمات بأن يكونوا على الأقل 18 عاماً.
