Repository: lahcenegue/good_one_app
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Modifying Data
ar: تعديل البيانات

# modifyingDataDescription
source: You may update or correct your personal data through the app.
ar: يمكنك تحديث أو تصحيح بياناتك الشخصية من خلال التطبيق.

source: Requesting Deletion
ar: طلب الحذف

# requestingDeletionDescription
source: You may request the deletion of your data, unless we are legally required to retain it.
ar: يمكنك طلب حذف بياناتك، ما لم نكن مطالبين قانونياً بالاحتفاظ بها.

# dataProtectionDescription
source: We implement security measures to protect your data from unauthorized access, alteration, or loss. However, absolute security over the internet cannot be guaranteed.
ar: نطبق تدابير أمنية لحماية بياناتك من الوصول غير المصرح به أو التغيير أو الفقدان. ومع ذلك، لا يمكن ضمان الأمان المطلق عبر الإنترنت.

# policyChangesDescription
source: We may update this policy from time to time. You will be notified of significant changes through in-app notifications or via email.
ar: قد نحدث هذه السياسة من وقت لآخر. ستتم إخطارك بالتغييرات المهمة من خلال إشعارات التطبيق أو عبر البريد الإلكتروني.

# contactUsDescription
source: If you have any questions about this Privacy Policy, you can contact us via email or phone. By using the app, you agree to the terms of this Privacy Policy.
ar: إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يمكنك الاتصال بنا عبر البريد الإلكتروني أو الهاتف. باستخدام التطبيق، فإنك توافق على شروط سياسة الخصوصية هذه.

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Total Earnings
ar: إجمالي الأرباح

source: This Month
ar: هذا الشهر

source: Balance Summary
ar: ملخص الرصيد

source: Available Balance
ar: الرصيد المتاح

source: Total Withdrawn
ar: إجمالي المسحوبات

source: Account Type
ar: نوع الحساب

source: Client
ar: عميل

source: Provider
ar: مزود خدمة

# clientDescription
source: Looking for services
ar: يبحث عن خدمات

# providerDescription
source: Offering services
ar: يقدم خدمات

# pleaseSelectAccountType
source: Please select an account type
ar: يرجى اختيار نوع الحساب
